
const obj = {
    code: 0,
    message: 'ok',
    data: {
        title: '有没有那么一首歌',
        author: '池小阿',
        duration: '04:46',
        pic: 'images/myImage.jpg',
        audio: 'images/mySong.m4a',
        lyric: "[00:00.000] 作词 : 李宗盛\n[00:00.835] 作曲 : 周传雄\n[00:01.671]池小小阿 - 有没有那么一首歌\n[00:05.424]作词：李焯雄、李宗盛\n[00:09.670]作曲：周传雄\n[00:11.413]编曲：黄楚权\n[00:12.922]灯熄灭了\n[00:15.162]月亮是寂寞的眼\n[00:18.667]静静看着谁孤枕难眠\n[00:25.414]远处传来那首熟悉的歌\n[00:32.173]那些心声为何那样微弱\n[00:39.670]很久不见\n[00:41.912]你现在都还好吗\n[00:45.672]你曾说过\n[00:48.168]你不愿一个人\n[00:52.419]我们都活在这个城市里面\n[00:59.164]却为何没有再见面\n[01:02.670]却只和陌生人擦肩\n[01:09.171]有没有那么一首歌\n[01:12.666]会让你轻轻跟着和\n[01:16.417]牵动我们共同过去\n[01:20.165]记忆它不会沉默\n[01:22.670]有没有那么一首歌\n[01:25.913]会让你心里记着我\n[01:30.163]让你欢喜也让你忧\n[01:33.169]这么一个我\n[02:04.412]很久不见\n[02:06.663]你现在都还好吗\n[02:10.170]你曾说过\n[02:12.912]你不愿一个人\n[02:16.917]我们都活在这个城市里面\n[02:23.417]却为何没有再见面\n[02:27.166]却只和陌生人擦肩\n[02:33.414]有没有那么一首歌\n[02:36.920]会让你轻轻跟着和\n[02:40.914]牵动我们共同过去\n[02:44.164]记忆它不会沉默\n[02:47.172]有没有那么一首歌\n[02:50.411]会让你心里记着我\n[02:54.671]让你欢喜也让你忧\n[02:57.666]这么一个我\n[03:00.661]有没有那么一首歌\n[03:03.913]会让你轻轻跟着和\n[03:08.161]牵动我们共同过去\n[03:11.168]记忆它不会沉默\n[03:14.163]有没有那么一首歌\n[03:17.416]会让你心里记着我\n[03:21.663]让你欢喜也让你忧\n[03:24.670]这么一个我\n[03:27.666]我现在唱的这首歌\n[03:30.918]若是让你想起了我\n[03:35.412]涌上来的若是寂寞\n[03:38.161]我想知道为什么\n[03:42.831]有没有那么一首歌\n[03:46.337]会让你轻轻跟着和\n[03:50.331]随着我们生命起伏\n[03:53.327]一起唱的主题歌\n[03:56.333]有没有那么一首歌\n[03:59.827]会让你突然想起我\n[04:04.079]让你欢喜也让你忧\n[04:07.085]这么一个我\n[04:10.081]我现在唱的这首歌\n[04:13.329]就代表我对你诉说\n[04:17.327]就算日子匆匆过去\n[04:20.576]我们曾走过\n[04:24.082]就算日子匆匆过去\n[04:27.834]我们曾走过\n"
    }
}

const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}